<a href="https://colab.research.google.com/github/M-I-N1985/colab_alura/blob/main/9_formas_de_selecoes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [ ]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [ ]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [ ]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [ ]:
type(df['c1'])

pandas.core.series.Series

In [ ]:
df[['c2', 'c4']]

    c2  c4
l1   2   4
l2   6   8
l3  10  12
l4  14  16

In [ ]:
type(df[['c2', 'c4']])

pandas.core.frame.DataFrame

In [ ]:
df[:] #seleção por indice (linha)

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [ ]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [ ]:
df[:3]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12

In [ ]:
df[:3][['c2', 'c4']] # seleção por indice e coluna

    c2  c4
l1   2   4
l2   6   8
l3  10  12

In [ ]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [ ]:
df.loc['l3'] # monta uma series da linha selecionada

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [ ]:
df.loc[['l3', 'l2']] # monta um dataframe das linhas selecionadas

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [ ]:
df.loc['l1', 'c2'] # encontra o numero na matriz

2

In [ ]:
df.iloc[0, 1] # encontra o numero na matriz, porém com indices numéricos

2

In [ ]:
df.loc[['l3', 'l1'], ['c4', 'c1']] # cria uma minimatriz seleciada pelas linhas e pelas colunas

    c4  c1
l3  12   8
l1   4   1

In [ ]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [ ]:
df.iloc[[2, 0], [3, 0]] # cria uma minimatriz seleciada pelas linhas e pelas colunas, porém com indices numericos

    c4  c1
l3  12   8
l1   4   1